Revit 2027 API
VertexPositionColored.GetSizeInFloats Method
 Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int GetSizeInFloats()
Public Shared Function GetSizeInFloats As Integer
public:
static int GetSizeInFloats()
static member GetSizeInFloats : unit -> int
Return Value
Int32
 The number of floats occupied by one vertex of this type.
See Also
Reference
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace